Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/educational_supports/special_educational_arrangements_for_travellers.html.txt.tmx
Source language: en
Languages: ga

source: Educational arrangements for Travellers
ga: Socraithe oideachais don Lucht Siúil

source: Traveller children have the same rights to education as settled children
ga: Tá na cearta oideachais céanna ag páistí an lucht siúil is atá ag páistí lonnaithe

source: They are also subject to the same rules on school attendance
ga: Caithfidh siad na rialacha a bhaineann le freastal ar an scoil a chomhlíonadh mar a chéile

source: A Traveller child can access additional learning supports in primary school and supports in post-primary school if there is an identified educational need
ga: Féadfaidh leanbh den Lucht Siúil rochtain a fháil ar bhreis tacaíochtaí foghlama sa bhunscoil agus ar thacaíochtaí i scoil iar-bhunscoile má shainaithnítear go bhfuil riachtanas oideachais ag an leanbh sin

source: Co-ordination of Traveller education
ga: Oideachas don Lucht Siúil a chomhordú

source: The Advisory Committee on Traveller Education published a Report and Recommendations for a Traveller Education Strategy (pdf)
ga: D’fhoilsigh an Coiste Comhairleach ar an Oideachas don Lucht Siúil Tuarascáil agus Moltaí do Straitéis Oideachais don Lucht Siúil

source: A key objective of the report is the phasing out of segregated Traveller provision and the inclusion of Traveller children and young people in mainstream education
ga: Príomhchuspóir na tuarascála is ea deireadh a chur, de réir a chéile, leis an soláthar don Lucht Siúil agus chun leanaí agus daoine óga den Lucht Siúil a chuimsiú in oideachas príomhshrutha

source: Guidelines on Traveller education in primary schools and post-primary schools are available from the Department of Education and Skills
ga: Tá fáil ar threoirlínte maidir le hoideachas don Lucht Siúil i mbunscoileanna agus in iar-bhunscoileanna ar fáil ón Roinn Oideachais agus Scileanna

source: The Department of Education and Skills is responsible for the co-ordination of Traveller education
ga: Tá an Roinn Oideachais agus Scileanna freagrach as oideachas an Lucht Siúil a chomhordú
